"use strict";

const descriptions = {
    'Гаррош': 'Гаррош Пекельний Крик , син легенди Орди Грому Пекельного Крику , і колишній лідер армії Пісні Війни є колишнім вождем Орди. З відкриттям Темного Порталу Гаррош був запрошений до Орди самим Траллом і був його особистим радником. Пізніше Гаррош очолював Армію Пісні Війни в Нордсколі і отримав посаду чинного вождя за відсутності Трала.',
    'Ірель': 'Народжена на Дренорі, у притулку вигнаних дреніїв, Ірель всю себе присвятила вірі. Вона росла послушницею в храмі Карабор - знаковому місці для її побратимів, які сповідують віру у Світло. Присвятивши себе віруванням та знанням, Ірель стала подавати великі надії у цілительстві. Її талант помітив пророк Велен.',
    'Трейсер': 'Олена Окстон (позивний: «Трейсер») стала наймолодшою учасницею експериментальної польотної програми Overwatch. Їй, безстрашному пілоту, надали можливість випробувати прототип нового міжпросторового винищувача «Суперспалах». Однак під час першого польоту відбулася відмова телепортуючої матриці, і бойова машина зникла. Олену порахували загиблою.',
    'Джайна': 'Джайна Праудмур – можливо одна з найбільших чарівниць цього світу. Колись, колишня подруга принца Артаса , Джайна на власні очі бачила падіння Лордерона . Взявши безпосередню участь у Третьій війні та обороні Світового дерева, вона заприсяглася знищувати зловісних агентів Палаючий Легіон . Керуючи портовим містом Терамором, де живуть залишки населення Лордеронського Альянсу, вона досі сподівається об\'єднати роздроблені королівства людей, як це було раніше.',
    'Малфуріон': 'Малфуріон Лють Бурі- нічний ельф, найсильніший і перший з друїдів, брат-близню Іллідана. Утрьох із Тирандою Шелест Вітру вони вчилися у напівбога Кенарія друїдизму, але лише Малфуріон прийняв навчання близько до серця. Іллідан віддав перевагу могутній магії Колодязя Вічності, а Тиранда стала жрицею богині Елуни. Таким чином, Малфуріон став першим друїдом. Під час Війни Стародавніх Малфуріон був одним з небагатьох знали, що королева Азшара зрадила їх.',
    'Анубарак': 'Ануб\'арак є царем нерубіанського королівства Азжол-Неруб . Він був убитий разом з іншими нерубіанцями за часів Війни Павука, а пізніше був воскресений Нер\'зулом і став підкорятися наказам Короля-лича.',
    'Малтаель': 'Малтаель був архангелом Мудрості, але покинув Небеса після руйнування Каміння світобудови. Потай він вирішив раз і назавжди покінчити з Вічним протистоянням: стати втіленням самої Смерті і винищити все, що торкнулося демонічного псування, включаючи людство.',
    'Фенікс': 'Він народився приблизно 2102 року. Фенікс служив у касті тамплієрів разом зі своїми друзями — Артанісом та Тассадаром, і бився з ворогами протосів у незліченних битвах. Серед інших, Фенікс боровся на планеті Даннас VII, населеної расою, відомої як тагал. Фенікс і Тассадар воювали з ворогами, яких було у співвідношенні 30:1, але все одно перемогли. За свої заслуги він був призначений претором.',
    'Хандзо': 'Хандзо родом з японського клану Шимада , старший син глави злочинної імперії, яка була побудована на контрабанді зброї та наркотиків. З ранніх років він готувався до того, щоб у майбутньому зайняти місце лідера клану, тому присвятив себе відточенню майстерності володіння мечем та стріляниною з лука. Хандзо володіє лідерськими якостями і відмінно розуміється на стратегії та тактиці.',
    'Тіранда': 'Тіранда Шелест (вимовляється Teh-Рана-д ) є обраною жрицею богині Елунов , колишні генеральний з нічних ельф Вартових і поточний глава Сестринства Елунов . Разом зі своїм товаришем протягом усього життя, архідруїдом Малфуріоном Ярость Бурі , вона представляла найвище керівництво нічних ельфів після падіння королеви Азшари та касти Високонароджених десять тисяч років тому.'
}

const click = (e) => {
    const name = e.target.textContent;
    alert(name + '\n' + descriptions[name]);
}

const over = (e) => {
    if (e.target.style.textDecoration === 'underline') {
        e.target.style.textDecoration = '';
    } else e.target.style.textDecoration = 'underline';
}
